In [5]:
import pandas as pd
import numpy as np
dates = pd.date_range('20211206',periods=6)
dates
df=pd.DataFrame(np.random.randn(6,4),index=dates,columns=list('ABCD'))                                                              
df['E']=[1,2,np.nan,np.nan,5,6]

In [10]:
df

                   A         B         C         D    E
2021-12-06 -1.778013  1.950086 -0.453788  0.066925  1.0
2021-12-07  0.832835  1.700209  0.098399 -0.975709  2.0
2021-12-08  0.893050 -0.615641 -0.243626  0.485131  NaN
2021-12-09  1.533977  0.721894  0.129966 -0.668473  NaN
2021-12-10  1.123752 -0.171099 -0.988816 -0.576357  5.0
2021-12-11 -0.283384 -0.320847  0.373096  0.797820  6.0

In [9]:
df.dropna(axis=0)

                   A         B         C         D    E
2021-12-06 -1.778013  1.950086 -0.453788  0.066925  1.0
2021-12-07  0.832835  1.700209  0.098399 -0.975709  2.0
2021-12-10  1.123752 -0.171099 -0.988816 -0.576357  5.0
2021-12-11 -0.283384 -0.320847  0.373096  0.797820  6.0

In [11]:
df.dropna(how='any')

                   A         B         C         D    E
2021-12-06 -1.778013  1.950086 -0.453788  0.066925  1.0
2021-12-07  0.832835  1.700209  0.098399 -0.975709  2.0
2021-12-10  1.123752 -0.171099 -0.988816 -0.576357  5.0
2021-12-11 -0.283384 -0.320847  0.373096  0.797820  6.0

In [13]:
df.dropna(axis=1)

                   A         B         C         D
2021-12-06 -1.778013  1.950086 -0.453788  0.066925
2021-12-07  0.832835  1.700209  0.098399 -0.975709
2021-12-08  0.893050 -0.615641 -0.243626  0.485131
2021-12-09  1.533977  0.721894  0.129966 -0.668473
2021-12-10  1.123752 -0.171099 -0.988816 -0.576357
2021-12-11 -0.283384 -0.320847  0.373096  0.797820

In [16]:
df.head(2)

                   A         B         C         D    E
2021-12-06 -1.778013  1.950086 -0.453788  0.066925  1.0
2021-12-07  0.832835  1.700209  0.098399 -0.975709  2.0

In [17]:
df.tail(2)

                   A         B         C         D    E
2021-12-10  1.123752 -0.171099 -0.988816 -0.576357  5.0
2021-12-11 -0.283384 -0.320847  0.373096  0.797820  6.0

In [18]:
df.to_numpy()

array([[-1.77801314,  1.95008559, -0.45378782,  0.06692496,  1.        ],
       [ 0.83283545,  1.7002087 ,  0.09839919, -0.9757088 ,  2.        ],
       [ 0.89305031, -0.61564081, -0.24362578,  0.4851314 ,         nan],
       [ 1.5339765 ,  0.72189426,  0.1299661 , -0.66847327,         nan],
       [ 1.12375174, -0.17109886, -0.98881586, -0.57635726,  5.        ],
       [-0.28338403, -0.32084717,  0.37309552,  0.7978199 ,  6.        ]])

In [19]:
df.describe()

              A         B         C         D         E
count  6.000000  6.000000  6.000000  6.000000  4.000000
mean   0.387036  0.544100 -0.180795 -0.145111  3.500000
std    1.220648  1.090838  0.492481  0.704423  2.380476
min   -1.778013 -0.615641 -0.988816 -0.975709  1.000000
25%   -0.004329 -0.283410 -0.401247 -0.645444  1.750000
50%    0.862943  0.275398 -0.072613 -0.254716  3.500000
75%    1.066076  1.455630  0.122074  0.380580  5.250000
max    1.533977  1.950086  0.373096  0.797820  6.000000

In [20]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2021-12-06 to 2021-12-11
Freq: D
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
 4   E       4 non-null      float64
dtypes: float64(5)
memory usage: 288.0 bytes

In [21]:
df.T

   2021-12-06  2021-12-07  2021-12-08  2021-12-09  2021-12-10  2021-12-11
A   -1.778013    0.832835    0.893050    1.533977    1.123752   -0.283384
B    1.950086    1.700209   -0.615641    0.721894   -0.171099   -0.320847
C   -0.453788    0.098399   -0.243626    0.129966   -0.988816    0.373096
D    0.066925   -0.975709    0.485131   -0.668473   -0.576357    0.797820
E    1.000000    2.000000         NaN         NaN    5.000000    6.000000

In [24]:
df.sort_index(axis=0,ascending=False) #0 index ,1 column

                   A         B         C         D    E
2021-12-11 -0.283384 -0.320847  0.373096  0.797820  6.0
2021-12-10  1.123752 -0.171099 -0.988816 -0.576357  5.0
2021-12-09  1.533977  0.721894  0.129966 -0.668473  NaN
2021-12-08  0.893050 -0.615641 -0.243626  0.485131  NaN
2021-12-07  0.832835  1.700209  0.098399 -0.975709  2.0
2021-12-06 -1.778013  1.950086 -0.453788  0.066925  1.0

In [25]:
df['A'] #Selecting a single column

2021-12-06   -1.778013
2021-12-07    0.832835
2021-12-08    0.893050
2021-12-09    1.533977
2021-12-10    1.123752
2021-12-11   -0.283384
Freq: D, Name: A, dtype: float64

In [26]:
#Titanic Data Frame

In [30]:
titanic_train =pd.read_csv('D:/Dixant/CDAC/Machine Learning/07/titanic.csv')
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [32]:
titanic_train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.00,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.00,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.45,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.00,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.75,NaN,Q

In [34]:
titanic_train.shape

(891, 12)

In [35]:
titanic_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [37]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [52]:
male=0
female=0

for i in range(891):
    a=titanic_train.Sex[i]
    if a=='male':
        male += 1
    elif a=='female':
        female += 1
        
print(male)
print(female)

577
314

In [50]:
titanic_train['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [54]:
titanic_train.dtypes[titanic_train.dtypes == 'object']

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [55]:
a=titanic_train.dtypes[titanic_train.dtypes == 'object']

In [56]:
a.describe()

count          5
unique         1
top       object
freq           5
dtype: object

In [57]:
titanic_train.dtypes[titanic_train.dtypes == 'object'].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [58]:
titanic_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [59]:
sum(titanic_train.isnull().sum())

866

In [61]:
titanic_train.Survived

0      0
1      1
2      1
3      1
4      0
      ..
886    0
887    1
888    0
889    1
890    0
Name: Survived, Length: 891, dtype: int64

In [71]:
male=0
female=0

for i in range(891):
    a=titanic_train.Sex[i]
    b=titanic_train.Survived[i]
    if a=='male' and b==1:
        male += 1
    elif a=='female' and b==1:
        female += 1
        
print("male: ",male)
print("female: ",female)

male:  109
female:  233

In [65]:
per_male=male/(male+female)*100
per_female=female/(male+female)*100

68.12865497076024

In [68]:
per_male

31.871345029239766

In [67]:
per_female

68.12865497076024

In [69]:
survival=titanic_train[titanic_train['Survived']==1]
survival['Sex'].value_counts()

female    233
male      109
Name: Sex, dtype: int64

In [81]:
nan_value=titanic_train[titanic_train['Age'].isnull()].index

In [82]:
print(nan_value)

Int64Index([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,
            ...
            832, 837, 839, 846, 849, 859, 863, 868, 878, 888],
           dtype='int64', length=177)

In [85]:
titanic_train["Fare"]==max(titanic_train["Fare"])

0      False
1      False
2      False
3      False
4      False
       ...
886    False
887    False
888    False
889    False
890    False
Name: Fare, Length: 891, dtype: bool

In [96]:
b=np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))

In [103]:
for i in b:
    name=titanic_train.iloc[i]
    print(name)

     PassengerId  Survived  Pclass                                Name  \
258          259         1       1                    Ward, Miss. Anna
679          680         1       1  Cardeza, Mr. Thomas Drake Martinez
737          738         1       1              Lesurer, Mr. Gustave J

        Sex   Age  SibSp  Parch    Ticket      Fare        Cabin Embarked
258  female  35.0      0      0  PC 17755  512.3292          NaN        C
679    male  36.0      0      1  PC 17755  512.3292  B51 B53 B55        C
737    male  35.0      0      0  PC 17755  512.3292         B101        C

In [106]:
for i in b:
    print(titanic_train.Name[i])

258                      Ward, Miss. Anna
679    Cardeza, Mr. Thomas Drake Martinez
737                Lesurer, Mr. Gustave J
Name: Name, dtype: object